{
	"2d": "T W O D I M E N S I O N A L S Y N T A X\nW O D I M E N S I O N A L S Y N T A X\nO D I M E N S I O N A L S Y N T A X\nD I M E N S I O N A L S Y N T A X\nI M E N S I O N A L S Y N T A X\nM E N S I O N A L S Y N T A X\nE N S I O N A L S Y N T A X\nN S I O N A L S Y N T A X\nS I O N A L S Y N T A X\nI O N A L S Y N T A X\nO N A L S Y N T A X\nN A L S Y N T A X\nA L S Y N T A X\nL S Y N T A X\nS Y N T A X\nY N T A X\nN T A X\nT A X\nA X\nX",
	"abstraction": "ABSTRACTION",
	"annoythenaesh": "Oh @thenaesh, how are you?",
	"apikey": "https://sanderknape.com/2018/03/secret-management-design-decisions-theory-plus-an-example/",
	"beans": "Hello,\n\nMy girlfriend and me have done dating for 5 month. I thought \"This girl is very good,\" and became of love with her.\n\nYet even so, on this Monday, I comed home and found she as baked all my beans.\n\nYes, all. Oh brother.\n\nIn my cupboard I store several bag of bean, to make soft and to bake on some days, to have a bit of baked bean on my dinner. Or, heck, a lunch too some days.\n\nBut on the Monday I find this girlfriend baked all the beans. I say \"Why do you bake my beans\", and she say something as \"I bakes them good to save time, so I bakes them all now.\"\n\nI am astonished and full of dissmay. I say \"I canfr not eat all the beans\", she say she is froze many of the beans so as we can unfrozen the on a later day and eat some at a time.\n\nBut, if a bean is froze and unfrozed, the very good and very nice flavor of bean is gone far.\n\nA bean is best if baked fresh as a Sunday Pie. Not to be froze and unfroze!\n\nI told my girfriend I am so sad of this, as to my opinion the baking of the beans and to freeze them has ruin all my beans. She say I am \"gone haywire\" by my enragement and sad manners.\n\nBut I hates what she did to my beans.\n\nOn the days before Monday I thought \"Will we marry the girlfriend? Well it might be so.\"\n\nBut now I am so sad she baked them beans. I am consider to end our relations and not be the boyfriend and girlfriend any more. But, is my idea wrong? Could my girlfriend make promise to not bake the beans? I do not know what doing to do and how to feel forgiving on her.\n\nWhat can I do on this situation I said here? (In the text I write above this.)\n\nThank you.\n\nOh yes TL;DR - So what I say is my girlfriend bakes all the beans in my house and freeze many of them, so as now most my beans is ruined and has no good flavors. This made me think maybe I breaked up with her? But will I? What can you say to help on me? Thank you.\n\nEdit: They locked up by topic but I ponder if it was the mistake, so, I did message the kindly moderators, so as if you has advices to put on me you could might still do. Thank you for the awards against my topic.",
	"bestmodules": "Here are the best modules: psmouse, rfkill, acpi_call, ip_tables",
	"camerashake": "camera shake",
	"ce": "counterexampled",
	"ceuec": "`C O U N T E R E X A M P L E D`",
	"chia": "But still, the bottom-line is this. You do not go through life in search for a rubric of success, and simply tick off every item on the checklist. At your stage, life is about the search for an endeavour that drives you with such a fervent passion that you wouldn't settle for anything else. And this positive drive will most certainly tick off some items in that checklist, but not all of them. Inevitably, there are sacrifices that you need to make, but these are nothing compared to the gratifications you get out of pursuing something that drives you.\n\n~ Prof Chia, Henry",
	"chinese": "Do you need Chinese tech support?",
	"close": "`close(fd);`",
	"counterexampled": "counterexampled",
	"cry": "https://www.youtube.com/watch?v=wXQCPAR0EHo",
	"curriculum": "The best CS curriculum:\n- Starts by learning Javascript that isn't really javascript. It's uncanny javascript.\n- Followed by OOP and Data Structures and Algos. But it isn't learning unless your prof makes you rotate trees and build heaps.\n- Then more data structures and algo! But this time you can Hand Wavier it!\n- Meanwhile, you can learn about computer architecture.\n- Finally, you can do intro to OS and networking!",
	"cursed": "cursed",
	"gatangoton": "https://www.youtube.com/watch?v=tyneiz9FRMw\n\nドゥンぱーぱーぱーぱーぱーぱーぱーぱードゥンぱーぱーぱーぱーぱーぱーぱー ドンおっタンドンドッお？ドッディンドンドッお〜！ドッパッドンドッドンパッパードンぬん！ドンおっタンドンドッお？ドッディンドンドッお〜！ドッハッディンドン(ドゥンぱーぱーぱーぱーぱーぱーぱーぱー)うんシャキーンYeees ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ キュピーンあは ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ YoYo失礼しますガチャッサササッしゅしゅしゅシュッしゅたっしゅびっデデーンほっズドーン！ドカーン！じゃーん！ゴロゴロデーンじゃん！タンタンんー？コソコソちらってくてくちらっえ〜...っと！ね〜ぇねぇってばえい！やっ！とう！シュッしゅびっしゅたっシャンシャンササッじゃん！シュッササッしゅびっほっほっしゅたっふん！シュッへっぷし!!!シャンシャンササッディシッにへへへへ(アッアン)ポチッとてい！だばぁえ！？ゴロゴロデュクシドカどぼーんぶくぶくぶく...グルグルボーンしゅたっやったぁ ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ ガタッ ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ ドキッタンタンへっぷし!!!ゴロゴロじゃん！ララララララララー(コーラス以下略 詳しくは歌詞下※にて) Let's goキラキラギュイーンピカピカピコーンもふもふなでなでにこにこグルグルデーンゴロゴロデデーンわくわくうずうずバタバタノロノロあ〜？ウロウロあってくてくコソコソガサガサすんすんお？ペロペロおっいただきますもぐもぐキラキラギュイーンピカピカピコーンもふもふなでなでにこにこグルグルデーンゴロゴロデデーンわくわくうずうずバタバタドコドコシャンタンタンシャーンぎゅんぎゅーんカッドンドッじゃーん！あははね！Yeahもぐもぐ×4もぐもぐ×4もぐもぐ×4おかわりもぐもぐ×4もぐもぐ×4もぐもぐ×4もぐもぐ×4うまーい！ ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ ごちそうさまでした ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ ドキッタンタンへっぷし!!!ゴロゴロじゃんララララララララー(コーラス以下略 詳しくは歌詞下※にて) ハイ！×56(フェードアウトする無音ハイ×4) LALALAー(Super Chorus Time) Are you ready？ララララララララー(以下略 ※にて) Let's goキラキラピカピカもふもふなでなでグルグルゴロゴロわくわくうずうずノロノロウロウロてくてくコソコソすんすんペロペロにこにこバタバタキラキラピカピカもふもふなでなでグルグルゴロゴロわくわくうずうずノロノロウロウロてくてくおっいただきますもぐもぐキラキラピカピカもふもふなでなでグルグルゴロゴロわくわくうずうずノロノロウロウロてくてくコソコソすんすんペロペロにこにこバタバタドコドコシャンタンタンシャーンぎゅんぎゅーんカッドンドッじゃーん！あはは ひとつの光が(Yeah)輝いて 言葉選んで紡いだの 辛いときも 寂しいときも 私がいるから 続く物語 星の絆で繋ぐから ずっとずっとずっと 私たちと貴方で 進み行くよだから 見ていてね YoYo ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ うへっうへへへへw ｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝﾄﾝｶﾞﾀﾝｺﾞﾄﾝｶﾞﾀﾝｺﾞﾄﾝ YoYo あー！",
	"gj": "Good Job!",
	"hackernews": "https://www.reddit.com/",
	"hand": "I am taking a CS mod this sem and for the past 8weeks prof Tan always leave a 'HAND' right before his name in forum post or announcement.\n\nWhen asked what does HAND mean, he mentioned he will reveal at the end of the semester. So initially I thought that HAND refer to the HAND stat in Maplestory that exist before the Chaos update.\n\nFor those who didn't play Maplestory, HAND referred to the combine stats of your Dexterity, Intelligent and Luck.\n\nI was amazed by this as I presumed this is the HAND prof Tan meant and it give a message like : Taking this mod requires dexterity in our fingers to do lab assignment/test, intelligent to understand the algorithm and luck that what we study come out. \n\nthen a TA mentioned it stands for 'Have A Nice Day'.\n\nWhat a let down =(",
	"help": "https://doc.rust-lang.org/stable/book/",
	"helphelp": "To use Deep Thinker: /manual\nTo use Evalbot: /help@slevalbot\nTo use Encik: /inspect\nTo use Pixel: /gender\nTo use this bot: Use your brain\nTo use Hartin Menz: Use your meme power\nTo use Plateletbot: Praise platelet for the good work that she does!",
	"hm": "H A C K E R M A N",
	"jcvspoly": "With all the talk about JC vs poly, I think I speak for most of us when I say this. We don't care if you are JC, Poly or a blueberry cheesecake from ITE. Just be a decent person and don't make trouble for others and there will be no line drawn. As a biz student, I had my fair share of experience with problematic people from BOTH JC and Poly, where you have them frat boys talking like they the shit and they gonna be the next wolf of wall street. Seriously, no one cares that you JUST HAD to pull off your \"helluva sick\" option play with $90 MU OTM Calls on your puny $300 account which you call a \"hedge fund\" because you \"studied the technical's\" and is so sure it will go up just so you can make $5 and buy your grandma a spoon such that everyone will see that you \"know what you are doing.\" Oh but when you make a loss suddenly it's all \"market volatility\" , \"an unexpected event happened\" and \"the feds be playing.\" Yeah right I could shove a soap bar up my arsehole and you probably blame your $50 loss because of that. But somehow, you still made the \"right play\" because you placed a stop loss and you already \"prepared for unexpected loss.\" Oh and the worst part? I simply ask you why your part of the project was so poorly done in contrast with the other group mates. Oh and when I really ask you about financial markets because I want to learn more? It's \"you wouldn't understand,\" \"you should read up on investopedia,\" \"Oh, only we members of the investment society knows this stuff inside out.\" Nigga I asking you why you chose to buy a particular option and not asking you why the damn sky is blue. And when I ask you what mods you are taking this sem? It's \"I'm trying to find time for my start up idea\" that is \"gonna make me be like Jeff Bezos.\" NO ONE CARES. Just tell me what mods you are taking! I don't care if you want to open a damn krusty krab at the bottom of the Singapore river and hire a scotch brite to flip burgers for you just so you can bring your phat whale daughter to see boys who cry. Why you gotta do this? When it's time to meet up for group meetings? \"I'm too busy\" or \"can you just help me with this part? I am a bit busy with my business.\" MATE, the only business you gonna be doing is the one in the toilet. JUST DO YOUR DAMN PROJECT. Yeah so. Remember, just be a decent human being and try not to cause problem for others. Majority of us welcome all of you, JC, Poly whatever. If you got time to be complaining, you got time to be working. Peace",
	"jpg": "JPG",
	"just": "`just`",
	"lee": "Shadow Emperor Lord Lee is one of the most powerful and oldest superhero in Singapore history. Once a powerful System Lord in a galaxy far, far away, Shadow Emperor Lord Lee took pity of a doomed nation filled with Singaporeans, but he had to pay his price for his intention. As such he was banished by God because his actions were deemed unspeakable. He was believed destroyed, but managed to escape and trick Jesus into helping him to ascend to a higher plane of existence. God took notice of such actions and forced him into a state between mortal existence and ascension. Because of his knowledge of God, Shadow Emperor Lord Lee amassed unimaginable advanced technologies and knowledge, spreading his eternal wisdom to transform a once useless ejaculate island to a massive reclaimed floating dynasty.",
	"lunch": "My lunch break is only 30 minutes. If I want to smoke during my lunch break, the walk to and fro and smoking will probably take 15 minutes. What if it rains? That’s ridiculous. It might make me cut down on smoking but I don’t think I will quit.",
	"maylee": "sorry i'm not pureblood",
	"nothard": "It is not hard to show that",
	"oop": "oop.... modern languages don't really have that anymore tho...",
	"open": "`int fd = open(\"/home/cs-ay1819/src/cancer/README.md\", RD_ONLY);`",
	"pledge": "We, the massive CS telegram chat group, pledge to be a toxic environment. We recommend that all incoming freshmen and current freshmen who are still stuck inside that if you wish to join a 'cohort' chat group, make sure it is a cohort level without a handful of sophomores empowering each other's epeen. We talk about fear-mongering. We are not role-modeling at all, open your eyes.",
	"proof": "Nontrivial but omitted.",
	"protagkun": "\"Eh, Nakai-san, I can't manage all that… erm, the coding parts are slowing down progress, let me settle this...\"\n\n The man speaking with Nakai— Kurata Tsubasa, sat down in a chair prepared by a colleague and started working immediately. He typed code into a text editor, read the progress reports and flipped through the specification manual, all the while giving instructions to the colleagues around him.\n\n \"Ensure the testing machine is operational. Test analysts, please take this opportunity to rest. Erm, we’ll begin intensive testing after 12. For coding...Tatsu-san, can you complete 2 modules? Yes, I’ll do the other 10. Kiba, there are some weird parts in the specification manual, please amend it and resume testing.\"\n\n He was only 28 years old and considered part of the younger generation within the workplace, but no one questioned his instructions. It was because of his track record within this company. His addition to the team managed to instill life into the half-dead workers, all of whom quickly carried out his instructions. Kurata had a unique nickname: the Last Line of Defense. Now that he was on the case, it meant the end of the job was in sight. Humans were realistic creatures. If they could see the end, they could endure the situation no matter how tough it was.\n\n \"Alright, that should do it. I’ll start coding.\"\n\n \"Hey, Kurata, will you be fine? 10 modules...that’s no laughing matter.\"\n\n \"Nakai-san, did you forget? Programming is my actual profession.\"\n\n With his eyes half closed, Kurata revealed a fearless smile on his gentle face. All 10 of his fingers started dancing at a frightening speed across the keyboard. He typed code into multiple open text editors, going through the data at a torrential pace. The mature man sitting opposite him, Tatsu, threw himself into his work the moment he heard the amazing typing sound.",
	"recursion": "/recursion /recursion",
	"reddit": "https://news.ycombinator.com/",
	"stars": "A star is type of astronomical object consisting of a luminous spheroid of plasma held together by its own gravity. The nearest star to Earth is the Sun. Many other stars are visible to the naked eye from Earth during the night, appearing as a multitude of fixed luminous points in the sky due to their immense distance from Earth. Historically, the most prominent stars were grouped into constellations and asterisms, the brightest of which gained proper names. Astronomers have assembled star catalogues that identify the known stars and provide standardized stellar designations. However, most of the stars in the Universe, including all stars outside our galaxy, the Milky Way, are invisible to the naked eye from Earth. Indeed, most are invisible from Earth even through the most powerful telescopes.",
	"swe": "sawf wear and gin nearing",
	"symref": "https://oeis.org/wiki/List_of_LaTeX_mathematical_symbols",
	"tawxic": "The mawsive CS tewegwam chat gwoup is a toxic enviwonment owo. I wecommend that aww incoming fweshmen and cuwent fweshmen who aww still stuck inside that if you wish to join a 'cohort' chat gwoup, make sure it is a cohort level without a handful of sophomowes empowewing each other's epween. Tawk about feaw-mongewing. This is not wole-modewing at all, open youw eyes OwO.",
	"testing": "one",
	"thenaesh": "Oh Thenaesh, how are you?",
	"toxic": "The massive CS telegram chat group is a toxic environment. I recommend that all incoming freshmen and current freshmen who are still stuck inside that if you wish to join a 'cohort' chat group, make sure it is a cohort level without a handful of sophomores empowering each other's epeen. Talk about fear-mongering. This is not role-modeling at all, open your eyes.",
	"tst": "people's teaching career also eventually terminate",
	"tutorial": "In one of the CS2106 tutorials, what happens almost every week is that one prodigy on the left of the classroom would start throwing random thoughts at some point of time, which might seem contributive at the start, but a group of other prodigies on the right of the classroom would start to refute against it, and the two sides would start debating with each other, which would develop into some real-life version of Livelock. The tutor simply cannot proceed with questions that follows, and sometimes even don’t have the time to finish the entire tutorial questions. One man’s A is ten other people’s B.",
	"w": "dableu",
	"whine": "CSxxxx this sem has got to be the worst module ever. So poorly taught to the point of absurdity.",
	"とっくしっく": "あの大規模なCSのTelegramグループは誠に有害な環境です。まだあのグループにいるCSの新入生のあなた型にこう一心に勧めます：CSの「同級生」のグループに参加することを望むならば、グループは真の同級生のを、お互いに自慢や072する二年生がいないのを、是非確認しなさい。恐怖心を煽っているだけで、全く率先垂範ではありません。目を醒ましなさい。",
	"トックシック": "あの大規模なCSのTelegramグループは誠に有害な環境です。まだあのグループにいるCSの新入生のあなた型にこう一心に勧めます：CSの「同級生」のグループに参加することを望むならば、グループは真の同級生のを、お互いに自慢や072する二年生がいないのを、是非確認しなさい。恐怖心を煽っているだけで、全く率先垂範ではありません。目を醒ましなさい。"
}
